[
  {
    "pregunta": "¿Cuál es la función de un coordinador PAN en una red IEEE 802.15.4?",
    "opciones": [
      "Se encarga de establecer la red y definir la estructura y el modo de operación",
      "Implementa la funcionalidad básica de la capa física y control de acceso al medio de 802.15.4",
      "Gestiona las comunicaciones entre diferentes redes PAN y WAN",
      "Solo actúa como dispositivo final sin capacidad de coordinación"
    ],
    "respuesta_correcta": 0,
    "pagina": 50
  },
  {
    "pregunta": "¿Cuál de las siguientes afirmaciones se refiere al Beacon frame en IEEE 802.15.4?",
    "opciones": [
      "Opcionalmente utilizado para la coordinación y sincronización de una red activa",
      "Para minimizar la latencia entre coordinador y dispositivo, ya que éste último puede chequear si tiene datos disponibles en el coordinador",
      "La dirección fuente contiene el PAN ID y la dirección del dispositivo",
      "Proporciona un tiempo de referencia para establecer los límites y estructuras de un superframe",
      "Todas las opciones son correctas"
    ],
    "respuesta_correcta": 4,
    "pagina": 67
  },
  {
    "pregunta": "En la estructura de la supertrama del estándar 802.15.4, ¿qué función cumplen los GTS (Guaranteed Time Slots)?",
    "opciones": [
      "Se usan para aplicaciones que requieren baja latencia o ancho de banda garantizado",
      "Permiten la transmisión aleatoria de todos los dispositivos",
      "Garantizan la sincronización de beacons entre redes vecinas",
      "Ninguna de las anteriores"
    ],
    "respuesta_correcta": 0,
    "pagina": 74
  },
  {
    "pregunta": "¿Cuál de las siguientes opciones es una desventaja de la comunicación por luz visible (VLC)?",
    "opciones": [
      "Es inofensiva para el cuerpo humano",
      "Utiliza una banda sin licencia",
      "La señal óptica no puede atravesar paredes",
      "Ninguna de las anteriores"
    ],
    "respuesta_correcta": 2,
    "pagina": 99
  },
  {
    "pregunta": "¿Cuál es la frecuencia utilizada por la tecnología Bluetooth?",
    "opciones": [
      "3,6 GHz",
      "2,4 GHz",
      "5 GHz",
      "900 MHz"
    ],
    "respuesta_correcta": 1,
    "pagina": 13
  },
  {
    "pregunta": "¿Qué tipo de dispositivo Bluetooth tiene más alcance?",
    "opciones": [
      "Clase 4",
      "Clase 1",
      "Clase 2",
      "Clase 3"
    ],
    "respuesta_correcta": 1,
    "pagina": 12
  },
  {
    "pregunta": "En los enlaces físicos de la capa de Banda Base de Bluetooth, ¿qué característica corresponde a un enlace ACL (Asynchronous-Connection-Less)?",
    "opciones": [
      "Se utiliza principalmente para transmitir voz a 64 Kbps",
      "Solo se transmite datos y se aplica retransmisión y reconocimiento",
      "El maestro puede soportar hasta 5 enlaces simultáneos",
      "No soporta broadcast"
    ],
    "respuesta_correcta": 1,
    "pagina": 38
  },
  {
    "pregunta": "En el estándar IEEE 802.15.4, ¿cuál de las siguientes afirmaciones sobre los tipos de dispositivos es correcta?",
    "opciones": [
      "Un dispositivo RFD (Reduced Function Device) puede actuar como coordinador PAN",
      "Un dispositivo FFD (Full Function Device) solo puede operar en topologías de estrella",
      "Un dispositivo RFD tiene una implementación reducida de los servicios MAC y no puede ser coordinador de una PAN",
      "Los dispositivos FFD y RFD tienen las mismas capacidades y funcionalidades"
    ],
    "respuesta_correcta": 2,
    "pagina": 51
  },
  {
    "pregunta": "¿Qué es una piconet en Bluetooth?",
    "opciones": [
      "Red punto a punto fija entre dos maestros",
      "Una red punto a punto y/o punto–multipunto formada por un maestro y varios esclavos compartiendo el mismo canal",
      "Un conjunto de redes Wi-Fi que comparten SSID",
      "El modo básico de conexión de Bluetooth sobre el que se construyen scatternets",
      "Una red exclusivamente de difusión (broadcast)"
    ],
    "respuesta_correcta": 1,
    "pagina": 32
  },
  {
    "pregunta": "En el canal físico de una piconet, ¿cómo se alternan los slots de transmisión?",
    "opciones": [
      "El maestro transmite en los slots pares y el esclavo en los impares",
      "El maestro transmite en los slots impares y el esclavo en los pares",
      "Ambos transmiten simultáneamente en todos los slots",
      "Solo el maestro transmite; el esclavo nunca transmite",
      "El reparto de slots es aleatorio"
    ],
    "respuesta_correcta": 0,
    "pagina": 34
  },
  {
    "pregunta": "¿Quién controla la comunicación en una red Bluetooth (piconet)?",
    "opciones": [
      "El dispositivo maestro",
      "Cualquiera de los esclavos",
      "Todos los dispositivos al mismo tiempo",
      "El dispositivo con más batería"
    ],
    "respuesta_correcta": 0,
    "pagina": 32
  },
  {
    "pregunta": "¿Cuántos dispositivos puede tener conectados un maestro en una piconet Bluetooth?",
    "opciones": [
      "Hasta 7 esclavos activos",
      "Solo 1 esclavo",
      "Hasta 3 esclavos",
      "Número ilimitado de esclavos"
    ],
    "respuesta_correcta": 0,
    "pagina": 32
  },
  {
    "pregunta": "¿Cuál de las siguientes afirmaciones describe correctamente un Reduced Function Device (RFD) en una red IEEE 802.15.4?",
    "opciones": [
      "Puede actuar como coordinador PAN y comunicarse con cualquier dispositivo",
      "Está limitado a topologías en estrella o como dispositivo final en redes punto a punto",
      "Implementa todas las funciones de la capa MAC y puede coordinar otros dispositivos"
    ],
    "respuesta_correcta": 1,
    "pagina": 51
  },
  {
    "pregunta": "¿Cuál de las siguientes opciones indica correctamente las bandas de frecuencia utilizadas por las redes IEEE 802.15.4?",
    "opciones": [
      "5 GHz, 3.6 GHz y 2.4 GHz",
      "868 MHz, 915 MHz y 2.4 GHz",
      "433 MHz, 1.2 GHz y 5 GHz"
    ],
    "respuesta_correcta": 1,
    "pagina": 48
  },
  {
    "pregunta": "¿Qué tipo de acceso al medio utiliza una red IEEE 802.15.4 habilitada por beacon?",
    "opciones": [
      "Unslotted CDMA/CA",
      "TDMA",
      "Slotted CSMA/CA",
      "FDMA",
      "ALOHA"
    ],
    "respuesta_correcta": 2,
    "pagina": 75
  },
  {
    "pregunta": "¿Qué tipo de dispositivo en una red IEEE 802.15.4 puede actuar como coordinador PAN?",
    "opciones": [
      "RFD (Reduced Function Device)",
      "Coordinador de clúster",
      "FFD (Full Function Device)",
      "Dispositivo final",
      "Nodo ZigBee"
    ],
    "respuesta_correcta": 2,
    "pagina": 51
  },
  {
    "pregunta": "¿Cuál de las siguientes NO es una característica de las redes IEEE 802.15.4?",
    "opciones": [
      "Bajo consumo energético",
      "Alta velocidad de transmisión (hasta 1 Gbps)",
      "Bajo ciclo de trabajo",
      "Bajo coste"
    ],
    "respuesta_correcta": 1,
    "pagina": 47
  },
  {
    "pregunta": "¿Qué norma define la capa física y MAC para VLC?",
    "opciones": [
      "IEEE 802.15.1",
      "IEEE 802.15.4",
      "IEEE 802.15.7",
      "IEEE 802.11ax"
    ],
    "respuesta_correcta": 2,
    "pagina": 5
  }
]